Repository: openstack/ironic-ui
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: ru

source: 2023.1 Series Release Notes
ru: Примечания к выпуску 2023.1

source: 2023.2 Series Release Notes
ru: Примечания к выпуску 2023.2

source: 2024.1 Series Release Notes
ru: Примечания к выпуску 2024.1

source: 2024.2 Series Release Notes
ru: Примечания к выпуску 2024.2

source: 2025.1 Series Release Notes
ru: Примечания к выпуску 2025.1

source: A backend mock has been added that enables better unit testing of the ironic-ui application by mocking the ironic API service. The mock utilizes angular $httpbackend handlers to intercept requests targeted at the ironic-ui server-side REST endpoints, and returns simulated responses.
ru: Добавлен mock бэкэнда, который позволяет улучшить модульное тестирование ironic-ui, имитируя API-службу ironic. Mock использует обработчики Angular $httpbackend для перехвата запросов, направленных на серверные REST точки доступа ironic-ui и возвращает смоделированные ответы.

source: A column has been added that displays the UUID of the portgroup to which the port belongs.
ru: Добавлен столбец, отображающий UUID группы портов, к которой принадлежит порт.

source: A number of unit tests have been developed that illustrate the use of the backend mock functionality.
ru: Разработан ряд модульных тестов, иллюстрирующих использование функциональности mock бэкэнда.

source: A portgroup table has been added to the node-details/configuration tab.
ru: Таблица групп портов добавлена на вкладку "Детали узла/Конфигурация".

source: Ability to enroll a node without all required fields for other states
ru: Возможность регистрации узла без заполнения всех обязательных полей для других состояний

source: Add and delete nodes
ru: Добавление и удаление узлов

source: Add and delete ports
ru: Добавление и удаление портов

source: Additional properties are displayed by clicking the detail-toggle-selector for that port in a similar manner to the portgroup table.
ru: Дополнительные свойства отображаются при нажатии на переключатель подробностей для соответствующего порта аналогично таблице групп портов.

source: Adds support for a user to be able to edit the ``resource_class`` field when enrolling/updating a node.
ru: Добавлена поддержка возможности редактирования пользователем поля ``resource_class`` при регистрации/обновлении узла.

source: Adds support for editing portgroups from the node-details/configuration page. Each entry in the portgroups table has an associated ``Edit portgroup`` button that when clicked will launch a modal dialog that guides the user in making changes.
ru: Добавлена поддержка изменения групп портов на странице "Детали узла/Конфигурация". Каждая запись в таблице групп портов имеет соответствующую кнопку "Изменить группу портов", при нажатии на которую открывается модальное диалоговое окно с инструкциями по внесению изменений.

source: Adds support for injecting non-maskable interrupts into a node. A new action ``Inject NMI`` has been added to the node actions dropdown menu in the ``Node Details`` page.
ru: Добавлена поддержка внедрения немаскируемых прерываний в узел. В раскрывающееся меню действий узла на странице ``Сведения об узле``, добавлено новое действие ``Внедрить NMI``.

source: Adds support for selecting driver interfaces for dynamic drivers while creating nodes. The support for driver interfaces is not compatible with classic drivers. This feature is supported with Pike and further versions of ironic.
ru: Добавлена поддержка выбора интерфейсов драйверов для динамических драйверов при создании узлов. Поддержка интерфейсов драйверов несовместима с классическими драйверами. Эта функция поддерживается в Pike и последующих версиях ironic.

source: Adds support for viewing and managing the portgroups associated with an ironic node.
ru: Добавлена поддержка просмотра и управления группами портов, связанными с узлом ironic.

source: Adds the ability to view and edit the node's ``resource_class`` field on the node-details/configuration page.
ru: Добавлена возможность просмотра и изменения поля ``resource_class`` узла на странице деталей узла/конфигурации.

source: Although the backend mock is a work in progress, enough functionality already exists to support test development for the current set of in-progress features.
ru: Несмотря на то, что mock бэкэнда находится в стадии разработки, уже существует достаточно функциональных возможностей для поддержки разработки тестов для текущего набора планируемых функций.

source: Breadcrumbs have been added
ru: Добавлена поддержка breadcrumbs

source: Bug Fixes
ru: Исправления ошибок

source: Current Series Release Notes
ru: Примечания к текущему выпуску

source: Currently it is not possible to edit a node via the UI once it has been enrolled. Therefore, the enrollment must be done accurately to ensure the node is enrolled accurately and can then be made available. At present, any errors made during enrollment can only be corrected by deleting the node and enrolling it again.
ru: В настоящее время невозможно изменить узел через пользовательский интерфейс после его регистрации. Поэтому, регистрация должна быть выполнена корректно, чтобы гарантировать корректную регистрацию узла и возможность его последующего использования. В настоящее время любые ошибки, допущенные при регистрации, можно исправить только путём удаления узла и его повторной регистрации.

source: Detailed information for a portgroup is obtained by clicking the detail-toggle-selector (right-chevron) located in its table row. The additional information is displayed in a row expansion.
ru: Подробную информацию о группе портов можно получить, щёлкнув по переключателю детализации (правый шеврон), расположенному в строке таблицы. Дополнительная информация отображается в развёрнутом виде.

source: Each row in the table displays a single portgroup, and has column entries for its UUID, MAC address, name, and number of ports. A dropdown menu is also provided that contains actions that can be applied to the portgroup.
ru: Каждая строка таблицы отображает одну группу портов и содержит столбцы с записями для её UUID, MAC-адреса, имени и количества портов. Также предусмотрено раскрывающееся меню с действиями, которые можно применить к группе портов.

source: Edit nodes after creation
ru: Изменение узлов после создания

source: Fixed ``_construct_http_client() takes at least 1 argument`` when creating an ironic client instance.
ru: Исправлена ошибка ``_construct_http_client() принимает как минимум 1 аргумент`` при создании клиентского инстанса ironic.

source: Fixes an issue where ``ironic-ui`` could fail when starting the Baremetal Service's API client when a user's authentication provider does not immediately support returning a ``project_id``. The remote Baremetal API service will retrieve this value from the Identity service.
ru: Исправлена ошибка, из-за которой ``ironic-ui`` мог сбоить при запуске API-клиента Baremetal, если провайдер аутентификации пользователя не поддерживает возврат ``project_id``. Удалённая служба Baremetal API будет получать это значение из службы идентификации.

source: For ``shellinabox``, the value is an anchor with the URL required to access the web console and title ``shellinabox``. For others, the value is a string representation of the ``console_info`` object returned by the ``get_console api`` call.
ru: Для ``shellinabox`` значение представляет собой якорь с URL-адресом, необходимым для доступа к веб-консоли, и заголовком ``shellinabox``. Для других значений значение представляет собой строковое представление объекта ``console_info``, возвращаемого вызовом ``get_console api``.

source: Ironic UI Release Notes
ru: Примечания к выпуску Ironic UI

source: Known Issues
ru: Известные проблемы

source: Move nodes between enroll, manageable, available and active states
ru: Перемещение узлов между состояниями "зарегистрирован", "управляемый", "доступен" и "активен"

source: New Features
ru: Новые возможности

source: Newton Series Release Notes (2.0.0 - 2.1.x)
ru: Примечания к выпуску Newton (2.0.0 - 2.1.x)

source: Ocata Series Release Notes (2.2.0 - 2.2.x)
ru: Примечания к выпуску Ocata (2.2.0 - 2.2.x)

source: Panel hidden if baremetal service or admin rights are not present
ru: Панель скрыта, если отсутствуют права baremetal или администратора

source: Pike Series Release Notes
ru: Примечания к выпуску Pike

source: Prelude
ru: Предисловие

source: Python 2.7 support has been dropped. Last release of ironic-ui to support Python 2.7 is OpenStack Train. The minimum version of Python now supported by ironic-ui is Python 3.6.
ru: Поддержка Python 2.7 была прекращена. Последний выпуск ironic-ui с поддержкой Python 2.7 - OpenStack Train. Минимальная версия Python, поддерживаемая ironic-ui - Python 3.6.

source: Queens Series Release Notes
ru: Примечания к выпуску Queens

source: Rocky Series Release Notes
ru: Примечания к выпуску Rocky

source: Stein Series Release Notes
ru: Примечания к выпуску Stein

source: Support for Python 3.8 has been removed. Now the minimum python version supported is 3.9 .
ru: Поддержка Python 3.8 была удалена. Теперь python 3.9 — минимальная поддерживаемая версия.

source: Support for Python 3.9 has been removed. Now Python 3.10 is the minimum version supported.
ru: Поддержка Python 3.9 была удалена. Теперь Python 3.10 — минимальная поддерживаемая версия.

source: Support has been added for inspecting nodes. For a node that is in the ``manageable`` state, its action menu will include an ``Inspect`` button. Node action menus are located in the node-list and node-detail pages.
ru: Добавлена поддержка проверки узлов. Для узла, находящегося в состоянии "управляемый", в меню действий появится кнопка "Проверить". Меню действий с узлами расположены на страницах списка узлов и сведений об узле.

source: Support has been added for starting, stopping, and accessing the console associated with a node.
ru: Добавлена поддержка запуска, остановки и доступа к консоли, связанной с узлом.

source: The Node Details/Configuration tab now shows the node's boot device.
ru: На вкладке "Детали узла"/"Конфигурация" теперь отображается загрузочное устройство узла.

source: The ``Properties`` column has been replaced with a column that displays only the boolean value of the ``pxe_enabled`` property.
ru: Столбец ``Свойства`` был заменен столбцом, который отображает только логическое значение свойства ``pxe_enabled``.

source: The action dropdown menu in the node-details panel has a new item ``Enable|Disable console``.
ru: В раскрывающемся меню действий на панели деталей узла появился новый пункт "Включить|Отключить консоль".

source: The current cleaning step is displayed in the Provisioning Status section of the node-details/overview page
ru: Текущий этап очистки отображается в разделе "Состояние подготовки" на странице деталей узла/обзора.

source: The node-details/configuration page has been extended to enable the user to edit ports after initial creation.
ru: Страница деталей узла/конфигурации была расширена, чтобы позволить пользователю редактировать порты после первоначального создания.

source: The node-details/overview panel has a new ``Console info`` item in the ``General`` section. The value of this field is dependent on the console type.
ru: На панели деталей узла/обзора в разделе ``Общее`` появился новый пункт ``Информация о консоли``. Значение этого поля зависит от типа консоли.

source: The port table in node-details/configuration tab has been modified as follows:
ru: Таблица портов на вкладке деталей узла/конфигурации была изменена следующим образом:

source: The user is now able to abort a node cleaning operation. When cleaning is aborted the node is moved from the ``CLEAN WAIT`` state to the ``CLEAN FAIL`` state. When appropriate an "Abort cleaning" action will be present in individual node action menu.
ru: Теперь пользователь может прервать операцию очистки узла. При прерывании очистки узел переходит из состояния "ОЧИСТКА ОЖИДАЕТСЯ" в состояние "ОЧИСТКА НЕ ВЫПОЛНЕНА". При необходимости действие "Прервать очистку" будет доступно в меню действий отдельного узла.

source: The user is now able to specify the pxe_enabled and local-link-connection attributes as part of defining/editing ports.
ru: Теперь пользователь может указать атрибуты pxe_enabled и local-link-connection при определении/изменении портов.

source: This release adds support for adding and deleting nodes. Support has also been added for adding and deleting ports. The panel will now be hidden if the baremetal service is not present in the scenario where the collection of running services differs between multiple keystone regions.
ru: В этом релизе добавлена поддержка добавления и удаления узлов. Также добавлена поддержка добавления и удаления портов. Панель теперь будет скрыта, если baremetal-служба отсутствует в сценарии, где набор запущенных служб различается в нескольких регионах Keystone.

source: This release adds support for editing nodes and moving those nodes between enroll, manageable, available and active states. It is now possible to enroll a node without all required fields for moving to manageable state being present due to the facility for editing the node once it has been created.
ru: В этом релизе добавлена поддержка редактирования узлов и их перевода между состояниями "Зарегистрирован", "Управляемый", "Доступен" и "Активен". Теперь можно зарегистрировать узел, не заполняя все обязательные поля для перевода в состояние "Управляемый", благодаря возможности изменения узла после его создания.

source: Train Series Release Notes
ru: Примечания к выпуску Train

source: UX improvements across the interface
ru: Улучшения UX во всем интерфейсе

source: Upgrade Notes
ru: Примечания к обновлению

source: Ussuri Series Release Notes
ru: Примечания к выпуску Ussuri

source: Victoria Series Release Notes
ru: Примечания к выпуску Victoria

source: Wallaby Series Release Notes
ru: Примечания к выпуску Wallaby

source: Xena Series Release Notes
ru: Примечания к выпуску Xena

source: Yoga Series Release Notes
ru: Примечания к выпуску Yoga

source: Zed Series Release Notes
ru: Примечания к выпуску Zed
